app/views/authors/show.html.erb

  <ul>
    <% @author.books.each do |book| %>
---
SELECT "books".* FROM "books" INNER JOIN "author_books" ON "books"."id" = "author_books"."book_id" WHERE "author_books"."author_id" = ?  [["author_id", 1]]

    <%= b.hidden_field :author_id, value: @author.id %>
    <%= b.collection_select :book_id, Book.all, :id, :title %>
---
SELECT "books".* FROM "books"