app/views/books/show.html.erb

SELECT "authors".* FROM "authors" INNER JOIN "author_books" ON "authors"."id" = "author_books"."author_id" WHERE "author_books"."book_id" = ?  [["book_id", 1]]
---
  <ul>
    <% @book.authors.each do |author| %>

SELECT "authors".* FROM "authors"
---
    <%= b.hidden_field :book_id, value: @book.id %>
    <%= b.collection_select :author_id, Author.all, :id, :name %>