app/controllers/authors_controller.rb

  def update
    @author = Author.find(params[:id])
    @author.books << Book.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "author_books" ("author_id", "book_id") VALUES (?, ?)  [["author_id", 1], ["book_id", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @author = Author.new(author_params)
    if @author.save
---
INSERT INTO "authors" ("name", "birth_year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Donald Trump"], ["birth_year", 1946], ["created_at", "2020-03-19 00:43:19.129841"], ["updated_at", "2020-03-19 00:43:19.129841"]]

  def delete_author_books
    @author_books = AuthorBook.find_by(author_id: params[:author_id], book_id: params[:book_id])
    @author_books.destroy
    redirect_to Author.find(params[:author_id])
---
SELECT "author_books".* FROM "author_books" WHERE "author_books"."author_id" = ? AND "author_books"."book_id" = ? LIMIT ?  [["author_id", 2], ["book_id", 3], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
DELETE FROM "author_books" WHERE "author_books"."id" = ?  [["id", 9]]
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]