app/controllers/author_books_controller.rb

SELECT "author_books".* FROM "author_books" WHERE "author_books"."author_id" = ? AND "author_books"."book_id" = ? LIMIT ?  [["author_id", 2], ["book_id", 2], ["LIMIT", 1]]
INSERT INTO "author_books" ("author_id", "book_id") VALUES (?, ?)  [["author_id", 2], ["book_id", 3]]
---
  def create
    if AuthorBook.find_by(author_book_params)
      redirect_to request.referrer
    else
      @author_book = AuthorBook.new(author_book_params)
      if @author_book.save