app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "page_count", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Steaks!"], ["page_count", 1800], ["created_at", "2020-03-19 00:49:16.527939"], ["updated_at", "2020-03-19 00:49:16.527939"]]

  def delete_author_books
    @author_book = AuthorBook.find_by(author_id: params[:author_id], book_id: params[:book_id])
    @author_book.destroy
    redirect_to Book.find(params[:book_id])
---
SELECT "author_books".* FROM "author_books" WHERE "author_books"."author_id" = ? AND "author_books"."book_id" = ? LIMIT ?  [["author_id", 1], ["book_id", 3], ["LIMIT", 1]]
DELETE FROM "author_books" WHERE "author_books"."id" = ?  [["id", 1]]
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]